//
//  DiZhiTable.swift
//  ZHOUYI
//
//  Created by Apple on 2019/4/1.
//  Copyright © 2019 FENGYX. All rights reserved.
//

import Foundation

class DiZhiTable : NSObject {
    
    static let WuXing: [String? : String?] = [
        "子" : "水",
        "丑" : "土",
        "寅" : "木",
        "卯" : "木",
        "辰" : "土",
        "巳" : "火",
        "午" : "火",
        "未" : "土",
        "申" : "金",
        "酉" : "金",
        "戌" : "土",
        "亥" : "水"
    ]
    static let Xing: [String? : String?] = [
        "子" : "卯",
        "丑" : "未",
        "寅" : "申",
        "卯" : "子",
        "辰" : "辰",
        "巳" : "寅",
        "午" : "午",
        "未" : "戌",
        "申" : "巳",
        "酉" : "酉",
        "戌" : "丑",
        "亥" : "亥"
    ]
    static let Chong: [String? : String?] = [
        "子" : "午",
        "丑" : "未",
        "寅" : "申",
        "卯" : "酉",
        "辰" : "戌",
        "巳" : "亥",
        "午" : "子",
        "未" : "丑",
        "申" : "寅",
        "酉" : "卯",
        "戌" : "辰",
        "亥" : "巳"
    ]
    static let He: [String? : String?] = [
        "子" : "丑",
        "丑" : "子",
        "寅" : "亥",
        "卯" : "戌",
        "辰" : "酉",
        "巳" : "申",
        "午" : "未",
        "未" : "午",
        "申" : "巳",
        "酉" : "辰",
        "戌" : "卯",
        "亥" : "寅"
    ]
    static let Hai: [String? : String?] = [
        "子" : "未",
        "丑" : "午",
        "寅" : "巳",
        "卯" : "辰",
        "辰" : "卯",
        "巳" : "寅",
        "午" : "丑",
        "未" : "子",
        "申" : "亥",
        "酉" : "戌",
        "戌" : "酉",
        "亥" : "申"
    ]
    static let Ke: [String? : (String?, String?, String?, String?)] = [
        "子" : ("巳", "午", nil, nil),
        "丑" : ("子", "亥", nil, nil),
        "寅" : ("丑", "辰", "未", "戌"),
        "卯" : ("丑", "辰", "未", "戌"),
        "辰" : ("子", "亥", nil, nil),
        "巳" : ("申", "酉", nil, nil),
        "午" : ("申", "酉", nil, nil),
        "未" : ("子", "亥", nil, nil),
        "申" : ("寅", "卯", nil, nil),
        "酉" : ("寅", "卯", nil, nil),
        "戌" : ("子", "亥", nil, nil),
        "亥" : ("巳", "午", nil, nil)
    ]
    static let Sheng: [String? : (String?, String?, String?, String?)] = [
        "子" : ("寅", "卯", nil, nil),
        "丑" : ("申", "酉", nil, nil),
        "寅" : ("巳", "午", nil, nil),
        "卯" : ("巳", "午", nil, nil),
        "辰" : ("申", "酉", nil, nil),
        "巳" : ("丑", "辰", "未", "戌"),
        "午" : ("丑", "辰", "未", "戌"),
        "未" : ("申", "酉", nil, nil),
        "申" : ("子", "亥", nil, nil),
        "酉" : ("子", "亥", nil, nil),
        "戌" : ("申", "酉", nil, nil),
        "亥" : ("寅", "卯", nil, nil)
    ]
    static let TaoHua: [String? : String?] = [
        "子" : "酉",
        "丑" : "午",
        "寅" : "卯",
        "卯" : "子",
        "辰" : "酉",
        "巳" : "午",
        "午" : "卯",
        "未" : "子",
        "申" : "酉",
        "酉" : "午",
        "戌" : "卯",
        "亥" : "子"
    ]
    static let YiMa: [String? : String?] = [
        "子" : "寅",
        "丑" : "亥",
        "寅" : "申",
        "卯" : "巳",
        "辰" : "寅",
        "巳" : "亥",
        "午" : "申",
        "未" : "巳",
        "申" : "寅",
        "酉" : "亥",
        "戌" : "申",
        "亥" : "巳"
    ]
    static let JieSha: [String? : String?] = [
        "子" : "巳",
        "丑" : "寅",
        "寅" : "亥",
        "卯" : "申",
        "辰" : "巳",
        "巳" : "寅",
        "午" : "亥",
        "未" : "申",
        "申" : "巳",
        "酉" : "寅",
        "戌" : "亥",
        "亥" : "申"
    ]
    static let WangShen: [String? : String?] = [
        "子" : "亥",
        "丑" : "申",
        "寅" : "巳",
        "卯" : "寅",
        "辰" : "亥",
        "巳" : "申",
        "午" : "巳",
        "未" : "寅",
        "申" : "亥",
        "酉" : "申",
        "戌" : "巳",
        "亥" : "寅"
    ]
    static let GuaXiu: [String? : String?] = [
        "子" : "戌",
        "丑" : "戌",
        "寅" : "丑",
        "卯" : "丑",
        "辰" : "丑",
        "巳" : "辰",
        "午" : "辰",
        "未" : "辰",
        "申" : "未",
        "酉" : "未",
        "戌" : "未",
        "亥" : "戌"
    ]
    static let GuChen: [String? : String?] = [
        "子" : "寅",
        "丑" : "寅",
        "寅" : "巳",
        "卯" : "巳",
        "辰" : "巳",
        "巳" : "申",
        "午" : "申",
        "未" : "申",
        "申" : "亥",
        "酉" : "亥",
        "戌" : "亥",
        "亥" : "寅"
    ]
    static let HongLuan: [String? : String?] = [
        "子" : "卯",
        "丑" : "寅",
        "寅" : "丑",
        "卯" : "子",
        "辰" : "亥",
        "巳" : "戌",
        "午" : "酉",
        "未" : "申",
        "申" : "未",
        "酉" : "午",
        "戌" : "巳",
        "亥" : "辰"
    ]
    static let TianXi: [String? : String?] = [
        "子" : "酉",
        "丑" : "申",
        "寅" : "未",
        "卯" : "午",
        "辰" : "巳",
        "巳" : "辰",
        "午" : "卯",
        "未" : "寅",
        "申" : "丑",
        "酉" : "子",
        "戌" : "亥",
        "亥" : "戌"
    ]
}
